app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT * FROM `articles` WHERE (`articles`.`created_at` = '2010-03-24 12:36:27')

  def show

    @article = Article.find(params[:id])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)

  def edit
    @article = Article.find(params[:id])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)

  def create

    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save
---
INSERT INTO `articles` (`slug`, `intro`, `created_at`, `title`, `body`, `attachment`, `updated_at`, `category_id`, `language_id`, `status`) VALUES('', '', '2010-04-01 12:38:46', '今天的文章', '', '', '2010-04-01 12:38:46', 2, 1, '')

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
UPDATE `articles` SET `updated_at` = '2010-03-25 12:10:40', `attachment` = '', `slug` = '', `intro` = '', `status` = 'live', `body` = '' WHERE `id` = 1

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 4)
DELETE FROM `articles` WHERE `id` = 4