app/controllers/comments_controller.rb

  def create
    @article=Article.find(params[:article_id])
    @comment=@article.comments.build(params[:comment])
    @comment.save!
---
SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
INSERT INTO `comments` (`comment`, `created_at`, `author`, `updated_at`, `article_id`, `parent_id`, `email`) VALUES('dg', '2010-04-02 06:59:00', 'gdf', '2010-04-02 06:59:00', 1, NULL, 'gdf')